Revit 2027 API
Revision.IssuedTo Property
 Indicates to whom this Revision was or will be issued.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string IssuedTo { get; set; }
Public Property IssuedTo As String
	Get
	Set
public:
property String^ IssuedTo {
	String^ get ();
	void set (String^ value);
}
member IssuedTo : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: This operation cannot be performed on Revisions that have already been issued.
See Also
Reference
Revision Class
Autodesk.Revit.DB Namespace